import java.util.Random;

/**
 * Created by Angela on 11/12/2017.
 */
public class Home_work3 {
    public static void main(String[] args) {
     //   1. Ստեղծել ծրագիր, որը զանգվածի մեջ կպահի  ( 0.1  -  1 ) -ը միջակայքում ընկած թվերը։
        double array[] = {0.1, 0.2, 0.3, 0.4, 0.5, 0.6, 0.7, 0.8, 0.9};
        for (int i = 0; i < array.length; i++) {
            System.out.print(array[i] + " ");
        }

        /*2. Ստեղծել ծրագիր, որը կունենա 7 - չափանի զանգվածի մեջ կպահի շաբաթվա օրերի պայմանական ջերմաստիճաններ
        երկուշաբթի - 17.8 աստիճան;
        երեքշաբթի - 18.4 աստիճան;
        չորեքշաբթի - 19.9 աստիճան;
        հինգշաբթի - 18.7 աստիճան;
        ուրբաթ - 16.2 աստիճան;
        շաբաթ - 15.1 աստիճան;
        կիրակի - 16.3 աստիճան;
        զանգվածի մեջ ջերմաստիճաններն ավելացնելուց հետո, ծրագիրը պետք է հաշվի տվյալ շաբաթվա միջին ջերմաստիճանը և տպի այն կոնսոլում։*/

        System.out.println();

   double weather[] = {17.8, 18.4, 19.9, 18.7,16.2, 15.1, 16.3 };
        double sum = 0;
        for (int i = 0; i < weather.length; i++) {
            sum += weather[i];
        }
        System.out.println(sum/weather.length);

     /*   3. Լրացուցիչ - ինչպես արդեն գիտենք յուրաքանչյուր char տիպի փոփոխական ունի իր թվային արժեքը.
      օրինակ անգլերեն այբուբենի մեծատառ A - ի թվային արժեքը 65 - ն է, B - ինը 66 և այդպես շարունակ մինչև Z տառը,
       որի թվային արժեքը կլինի 90 - ը (քանի որ անգլերեն այբուբենում կա 26 տառ։
                Առաջադրանք - ստանալ անգլերեն այբուբենի բոլոր տառերն, մեկ հատ for ցիկլի օգնությամբ և  ավելացնել դրանք զանգվածի մեջ։
                Մեկ այլ ցիկլի օգնությամբ կոնսոլում տպել ստացված զանգվածի էլեմենտները։*/

     char ch;
        char abc[] = new char[26];
        for (int i = 0; i < 26 ; i++) {
              ch = (char)(i + 65);
            abc[i] = ch;
        }
        for (int i = 0; i < abc.length; i++) {
            System.out.print(abc[i] + " ");
        }

    }
}
